[Killed] Regex
main/components/HelpRequests/HelpRequestForm.js:21:22
    
     const navigate = useNavigate();
 
-    const isoRegex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i
+    const isoRegex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[^01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i
     const testIdPrefix = "HelpRequestForm";
 
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">requestTime must be in ISO format</div> instead

[Killed] Regex
main/components/HelpRequests/HelpRequestForm.js:21:22
    
     const navigate = useNavigate();
 
-    const isoRegex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i
+    const isoRegex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\D)/i
     const testIdPrefix = "HelpRequestForm";
 
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">requestTime must be in ISO format</div> instead

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:48:52
                     id="requesterEmail"
                     type="text"
                     isInvalid={Boolean(errors.requesterEmail)}
-                    {...register("requesterEmail", {
-                        required: "requesterEmail is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
-                    })}
+                    {...register("requesterEmail", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /requesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:50:37
                     isInvalid={Boolean(errors.requesterEmail)}
                     {...register("requesterEmail", {
                         required: "requesterEmail is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:88:57
                     id="tableOrBreakoutRoom"
                     type="text"
                     isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-                    {...register("tableOrBreakoutRoom", {
-                        required: "tableOrBreakoutRoom is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
-                    })}
+                    {...register("tableOrBreakoutRoom", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /tableOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:90:37
                     isInvalid={Boolean(errors.tableOrBreakoutRoom)}
                     {...register("tableOrBreakoutRoom", {
                         required: "tableOrBreakoutRoom is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:108:53
                         id="requestTime"
                         type="text"
                         isInvalid={Boolean(errors.requestTime)}
-                        {...register("requestTime", {
-                            required: "requestTime is required.",
-                            pattern: {
-                            value: isoRegex,
-                            message: "requestTime must be in ISO format",
-                        },
-                        })}
+                        {...register("requestTime", {})}
                     />
                 <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /requestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
