[Survived] BlockStatement
src/main/utils/HelpRequestUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/helprequests",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 

[Survived] StringLiteral
src/main/utils/HelpRequestUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/helprequests",
-        method: "DELETE",
+        method: "",
         params: {
             id: cell.row.values.id
