[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:108:53
                         id="requestTime"
                         type="text"
                         isInvalid={Boolean(errors.requestTime)}
-                        {...register("requestTime", {
-                            required: "requestTime is required.",
-                            pattern: {
-                            value: isodate_regex,
-                            message: "requestTime must be in ISO format",
-                        },
-                        })}
+                        {...register("requestTime", {})}
                     />
                 <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /requestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
