[Killed] BlockStatement
main/components/HelpRequests/HelpRequestTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/helprequests/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/helprequests/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:47:21
             accessor: 'teamId',
         },
         {
-            Header: 'TableOrBreakoutRoom',
+            Header: "",
             accessor: 'tableOrBreakoutRoom',
         },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: TableOrBreakoutRoom. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.js:50:9
             Header: 'TableOrBreakoutRoom',
             accessor: 'tableOrBreakoutRoom',
         },
-        {
-            Header: 'RequestTime',
-            accessor: 'requestTime',
-        },
+        {},
         {
             Header: 'Explanation',
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:60:23
         },
         {
             Header: 'Solved',
-            accessor: 'solved',
+            accessor: "",
         }
     ];
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-solved"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
